In [1]:
from sqlalchemy import create_engine

In [2]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
database = create_engine(connection_string)

In [4]:
import pandas as pd

nulls in lat, testing

In [5]:
# Vs this:
query = '''
SELECT COUNT(latitude)
FROM scooters;
'''

result = database.execute(query)

In [6]:
lat = pd.read_sql(query, con = database)
lat.head()

      count
0  73414043

In [7]:
lat_null = '''
SELECT COUNT(*)
FROM scooters
WHERE latitude IS NULL;
'''
result = database.execute(lat_null)

In [9]:
num_of_nulls_in_lat = pd.read_sql(lat_null, con = database)
num_of_nulls_in_lat.head()

   count
0      0

- Are there any null values in any columns in either table?

What date range is represented in each of the date columns? Investigate any values that seem odd.

In [11]:
min_date = '''
SELECT MIN(startdate)
FROM trips;
'''

result = database.execute(min_date)

In [12]:
min_date_range = pd.read_sql(min_date, con = database)
min_date_range.head()

          min
0  2019-05-01

In [13]:
max_date = '''
SELECT MAX(startdate)
FROM trips;
'''

result = database.execute(max_date)

In [14]:
max_date_range = pd.read_sql(max_date, con = database)
max_date_range.head()

          max
0  2019-07-31

- Is time represented with am/pm or using 24 hour values in each of the columns that include time?